HeepIO/HeepESP8266Boards/HeepESPPackage/boards.txt
#
# this file is script-generated and is likely to be overwritten by ./tools/boards.txt.py
#

menu.BoardModel=Model
menu.UploadSpeed=Upload Speed
menu.CpuFrequency=CPU Frequency
menu.CrystalFreq=Crystal Frequency
menu.FlashSize=Flash Size
menu.FlashMode=Flash Mode
menu.FlashFreq=Flash Frequency
menu.ResetMethod=Reset Method
menu.ESPModule=Module
menu.Debug=Debug port
menu.DebugLevel=Debug Level
menu.LwIPVariant=lwIP Variant
menu.led=Builtin Led

##############################################################
genericHeepESP.name=Heep ESP8266
genericHeepESP.build.board=ESP8266_GENERIC
genericHeepESP.build.variant=generic
genericHeepESP.upload.tool=esptool
genericHeepESP.upload.maximum_data_size=81920
genericHeepESP.upload.wait_for_upload_port=true
genericHeepESP.serial.disableDTR=true
genericHeepESP.serial.disableRTS=true
genericHeepESP.build.mcu=esp8266
genericHeepESP.build.core=esp8266
genericHeepESP.build.spiffs_pagesize=256
genericHeepESP.build.debug_port=
genericHeepESP.build.debug_level=
genericHeepESP.menu.CpuFrequency.80=80 MHz
genericHeepESP.menu.CpuFrequency.80.build.f_cpu=80000000L
genericHeepESP.menu.CpuFrequency.160=160 MHz
genericHeepESP.menu.CpuFrequency.160.build.f_cpu=160000000L
genericHeepESP.upload.resetmethod=nodemcu
genericHeepESP.build.flash_mode=qio
genericHeepESP.build.flash_freq=40
genericHeepESP.menu.FlashSize.4M1M=4M (1M SPIFFS)
genericHeepESP.menu.FlashSize.4M1M.build.flash_size=4M
genericHeepESP.menu.FlashSize.4M1M.build.flash_ld=eagle.flash.4m1m.ld
genericHeepESP.menu.FlashSize.4M1M.build.spiffs_pagesize=256
genericHeepESP.menu.FlashSize.4M1M.upload.maximum_size=1044464
genericHeepESP.menu.FlashSize.4M1M.build.spiffs_start=0x300000
genericHeepESP.menu.FlashSize.4M1M.build.spiffs_end=0x3FB000
genericHeepESP.menu.FlashSize.4M1M.build.spiffs_blocksize=8192
genericHeepESP.menu.FlashSize.4M3M=4M (3M SPIFFS)
genericHeepESP.menu.FlashSize.4M3M.build.flash_size=4M
genericHeepESP.menu.FlashSize.4M3M.build.flash_ld=eagle.flash.4m.ld
genericHeepESP.menu.FlashSize.4M3M.build.spiffs_pagesize=256
genericHeepESP.menu.FlashSize.4M3M.upload.maximum_size=1044464
genericHeepESP.menu.FlashSize.4M3M.build.spiffs_start=0x100000
genericHeepESP.menu.FlashSize.4M3M.build.spiffs_end=0x3FB000
genericHeepESP.menu.FlashSize.4M3M.build.spiffs_blocksize=8192
genericHeepESP.menu.LwIPVariant.v2mss536=v2 Prebuilt (MSS=536)
genericHeepESP.menu.LwIPVariant.v2mss536.build.lwip_include=lwip2/include
genericHeepESP.menu.LwIPVariant.v2mss536.build.lwip_lib=-llwip2
genericHeepESP.menu.LwIPVariant.v2mss536.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536
genericHeepESP.menu.LwIPVariant.v2mss1460=v2 Prebuilt (MSS=1460, unstable)
genericHeepESP.menu.LwIPVariant.v2mss1460.build.lwip_include=lwip2/include
genericHeepESP.menu.LwIPVariant.v2mss1460.build.lwip_lib=-llwip2_1460
genericHeepESP.menu.LwIPVariant.v2mss1460.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460
genericHeepESP.menu.LwIPVariant.Prebuilt=v1.4 Prebuilt
genericHeepESP.menu.LwIPVariant.Prebuilt.build.lwip_lib=-llwip_gcc
genericHeepESP.menu.LwIPVariant.Prebuilt.build.lwip_flags=-DLWIP_OPEN_SRC
genericHeepESP.menu.LwIPVariant.OpenSource=v1.4 Open Source
genericHeepESP.menu.LwIPVariant.OpenSource.build.lwip_lib=-llwip_src
genericHeepESP.menu.LwIPVariant.OpenSource.build.lwip_flags=-DLWIP_OPEN_SRC
genericHeepESP.menu.LwIPVariant.OpenSource.recipe.hooks.sketch.prebuild.1.pattern=make -C "{runtime.platform.path}/tools/sdk/lwip/src" install TOOLS_PATH="{runtime.tools.xtensa-lx106-elf-gcc.path}/bin/xtensa-lx106-elf-"
genericHeepESP.menu.Debug.Disabled=Disabled
genericHeepESP.menu.Debug.Disabled.build.debug_port=
genericHeepESP.menu.Debug.Serial=Serial
genericHeepESP.menu.Debug.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
genericHeepESP.menu.Debug.Serial1=Serial1
genericHeepESP.menu.Debug.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
genericHeepESP.menu.DebugLevel.None____=None
genericHeepESP.menu.DebugLevel.None____.build.debug_level=
genericHeepESP.menu.DebugLevel.SSL=SSL
genericHeepESP.menu.DebugLevel.SSL.build.debug_level= -DDEBUG_ESP_SSL
genericHeepESP.menu.DebugLevel.TLS_MEM=TLS_MEM
genericHeepESP.menu.DebugLevel.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
genericHeepESP.menu.DebugLevel.HTTP_CLIENT=HTTP_CLIENT
genericHeepESP.menu.DebugLevel.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
genericHeepESP.menu.DebugLevel.HTTP_SERVER=HTTP_SERVER
genericHeepESP.menu.DebugLevel.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
genericHeepESP.menu.DebugLevel.SSLTLS_MEM=SSL+TLS_MEM
genericHeepESP.menu.DebugLevel.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
genericHeepESP.menu.DebugLevel.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
genericHeepESP.menu.DebugLevel.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
genericHeepESP.menu.DebugLevel.SSLHTTP_SERVER=SSL+HTTP_SERVER
genericHeepESP.menu.DebugLevel.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
genericHeepESP.menu.DebugLevel.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
genericHeepESP.menu.DebugLevel.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
genericHeepESP.menu.DebugLevel.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
genericHeepESP.menu.DebugLevel.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
genericHeepESP.menu.DebugLevel.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
genericHeepESP.menu.DebugLevel.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
genericHeepESP.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
genericHeepESP.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
genericHeepESP.menu.DebugLevel.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
genericHeepESP.menu.DebugLevel.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
genericHeepESP.menu.DebugLevel.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
genericHeepESP.menu.DebugLevel.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
genericHeepESP.menu.DebugLevel.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
genericHeepESP.menu.DebugLevel.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
genericHeepESP.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
genericHeepESP.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
genericHeepESP.menu.DebugLevel.CORE=CORE
genericHeepESP.menu.DebugLevel.CORE.build.debug_level= -DDEBUG_ESP_CORE
genericHeepESP.menu.DebugLevel.WIFI=WIFI
genericHeepESP.menu.DebugLevel.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
genericHeepESP.menu.DebugLevel.HTTP_UPDATE=HTTP_UPDATE
genericHeepESP.menu.DebugLevel.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
genericHeepESP.menu.DebugLevel.UPDATER=UPDATER
genericHeepESP.menu.DebugLevel.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
genericHeepESP.menu.DebugLevel.OTA=OTA
genericHeepESP.menu.DebugLevel.OTA.build.debug_level= -DDEBUG_ESP_OTA
genericHeepESP.menu.DebugLevel.COREWIFIHTTP_UPDATEUPDATEROTA=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA
genericHeepESP.menu.DebugLevel.COREWIFIHTTP_UPDATEUPDATEROTA.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA
genericHeepESP.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTA=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA
genericHeepESP.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTA.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA
genericHeepESP.menu.DebugLevel.NoAssert-NDEBUG=NoAssert-NDEBUG
genericHeepESP.menu.DebugLevel.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
genericHeepESP.menu.UploadSpeed.115200=115200
genericHeepESP.menu.UploadSpeed.115200.upload.speed=115200
genericHeepESP.menu.UploadSpeed.9600=9600
genericHeepESP.menu.UploadSpeed.9600.upload.speed=9600
genericHeepESP.menu.UploadSpeed.57600=57600
genericHeepESP.menu.UploadSpeed.57600.upload.speed=57600
genericHeepESP.menu.UploadSpeed.230400.linux=230400
genericHeepESP.menu.UploadSpeed.230400.macosx=230400
genericHeepESP.menu.UploadSpeed.230400.upload.speed=230400
genericHeepESP.menu.UploadSpeed.256000.windows=256000
genericHeepESP.menu.UploadSpeed.256000.upload.speed=256000
genericHeepESP.menu.UploadSpeed.460800.linux=460800
genericHeepESP.menu.UploadSpeed.460800.macosx=460800
genericHeepESP.menu.UploadSpeed.460800.upload.speed=460800
genericHeepESP.menu.UploadSpeed.512000.windows=512000
genericHeepESP.menu.UploadSpeed.512000.upload.speed=512000
genericHeepESP.menu.UploadSpeed.921600=921600
genericHeepESP.menu.UploadSpeed.921600.upload.speed=921600

heepACSwitch.name=Heep AC
heepACSwitch.build.board=ESP8266_GENERIC
heepACSwitch.build.variant=generic
heepACSwitch.upload.tool=esptool
heepACSwitch.upload.maximum_data_size=81920
heepACSwitch.upload.wait_for_upload_port=true
heepACSwitch.serial.disableDTR=true
heepACSwitch.serial.disableRTS=true
heepACSwitch.build.mcu=esp8266
heepACSwitch.build.core=esp8266
heepACSwitch.build.spiffs_pagesize=256
heepACSwitch.build.debug_port=
heepACSwitch.build.debug_level=
heepACSwitch.menu.CpuFrequency.80=80 MHz
heepACSwitch.menu.CpuFrequency.80.build.f_cpu=80000000L
heepACSwitch.menu.CpuFrequency.160=160 MHz
heepACSwitch.menu.CpuFrequency.160.build.f_cpu=160000000L
heepACSwitch.upload.resetmethod=nodemcu
heepACSwitch.build.flash_mode=dout
heepACSwitch.build.flash_freq=40
heepACSwitch.menu.FlashSize.4M1M=4M (1M SPIFFS)
heepACSwitch.menu.FlashSize.4M1M.build.flash_size=4M
heepACSwitch.menu.FlashSize.4M1M.build.flash_ld=eagle.flash.4m1m.ld
heepACSwitch.menu.FlashSize.4M1M.build.spiffs_pagesize=256
heepACSwitch.menu.FlashSize.4M1M.upload.maximum_size=1044464
heepACSwitch.menu.FlashSize.4M1M.build.spiffs_start=0x300000
heepACSwitch.menu.FlashSize.4M1M.build.spiffs_end=0x3FB000
heepACSwitch.menu.FlashSize.4M1M.build.spiffs_blocksize=8192
heepACSwitch.menu.FlashSize.4M3M=4M (3M SPIFFS)
heepACSwitch.menu.FlashSize.4M3M.build.flash_size=4M
heepACSwitch.menu.FlashSize.4M3M.build.flash_ld=eagle.flash.4m.ld
heepACSwitch.menu.FlashSize.4M3M.build.spiffs_pagesize=256
heepACSwitch.menu.FlashSize.4M3M.upload.maximum_size=1044464
heepACSwitch.menu.FlashSize.4M3M.build.spiffs_start=0x100000
heepACSwitch.menu.FlashSize.4M3M.build.spiffs_end=0x3FB000
heepACSwitch.menu.FlashSize.4M3M.build.spiffs_blocksize=8192
heepACSwitch.menu.LwIPVariant.v2mss536=v2 Prebuilt (MSS=536)
heepACSwitch.menu.LwIPVariant.v2mss536.build.lwip_include=lwip2/include
heepACSwitch.menu.LwIPVariant.v2mss536.build.lwip_lib=-llwip2
heepACSwitch.menu.LwIPVariant.v2mss536.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536
heepACSwitch.menu.LwIPVariant.v2mss1460=v2 Prebuilt (MSS=1460, unstable)
heepACSwitch.menu.LwIPVariant.v2mss1460.build.lwip_include=lwip2/include
heepACSwitch.menu.LwIPVariant.v2mss1460.build.lwip_lib=-llwip2_1460
heepACSwitch.menu.LwIPVariant.v2mss1460.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460
heepACSwitch.menu.LwIPVariant.Prebuilt=v1.4 Prebuilt
heepACSwitch.menu.LwIPVariant.Prebuilt.build.lwip_lib=-llwip_gcc
heepACSwitch.menu.LwIPVariant.Prebuilt.build.lwip_flags=-DLWIP_OPEN_SRC
heepACSwitch.menu.LwIPVariant.OpenSource=v1.4 Open Source
heepACSwitch.menu.LwIPVariant.OpenSource.build.lwip_lib=-llwip_src
heepACSwitch.menu.LwIPVariant.OpenSource.build.lwip_flags=-DLWIP_OPEN_SRC
heepACSwitch.menu.LwIPVariant.OpenSource.recipe.hooks.sketch.prebuild.1.pattern=make -C "{runtime.platform.path}/tools/sdk/lwip/src" install TOOLS_PATH="{runtime.tools.xtensa-lx106-elf-gcc.path}/bin/xtensa-lx106-elf-"
heepACSwitch.menu.Debug.Disabled=Disabled
heepACSwitch.menu.Debug.Disabled.build.debug_port=
heepACSwitch.menu.Debug.Serial=Serial
heepACSwitch.menu.Debug.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
heepACSwitch.menu.Debug.Serial1=Serial1
heepACSwitch.menu.Debug.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
heepACSwitch.menu.DebugLevel.None____=None
heepACSwitch.menu.DebugLevel.None____.build.debug_level=
heepACSwitch.menu.DebugLevel.SSL=SSL
heepACSwitch.menu.DebugLevel.SSL.build.debug_level= -DDEBUG_ESP_SSL
heepACSwitch.menu.DebugLevel.TLS_MEM=TLS_MEM
heepACSwitch.menu.DebugLevel.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
heepACSwitch.menu.DebugLevel.HTTP_CLIENT=HTTP_CLIENT
heepACSwitch.menu.DebugLevel.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
heepACSwitch.menu.DebugLevel.HTTP_SERVER=HTTP_SERVER
heepACSwitch.menu.DebugLevel.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
heepACSwitch.menu.DebugLevel.SSLTLS_MEM=SSL+TLS_MEM
heepACSwitch.menu.DebugLevel.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
heepACSwitch.menu.DebugLevel.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
heepACSwitch.menu.DebugLevel.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
heepACSwitch.menu.DebugLevel.SSLHTTP_SERVER=SSL+HTTP_SERVER
heepACSwitch.menu.DebugLevel.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
heepACSwitch.menu.DebugLevel.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
heepACSwitch.menu.DebugLevel.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
heepACSwitch.menu.DebugLevel.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
heepACSwitch.menu.DebugLevel.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
heepACSwitch.menu.DebugLevel.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
heepACSwitch.menu.DebugLevel.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
heepACSwitch.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
heepACSwitch.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
heepACSwitch.menu.DebugLevel.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
heepACSwitch.menu.DebugLevel.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
heepACSwitch.menu.DebugLevel.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
heepACSwitch.menu.DebugLevel.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
heepACSwitch.menu.DebugLevel.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
heepACSwitch.menu.DebugLevel.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
heepACSwitch.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
heepACSwitch.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
heepACSwitch.menu.DebugLevel.CORE=CORE
heepACSwitch.menu.DebugLevel.CORE.build.debug_level= -DDEBUG_ESP_CORE
heepACSwitch.menu.DebugLevel.WIFI=WIFI
heepACSwitch.menu.DebugLevel.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
heepACSwitch.menu.DebugLevel.HTTP_UPDATE=HTTP_UPDATE
heepACSwitch.menu.DebugLevel.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
heepACSwitch.menu.DebugLevel.UPDATER=UPDATER
heepACSwitch.menu.DebugLevel.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
heepACSwitch.menu.DebugLevel.OTA=OTA
heepACSwitch.menu.DebugLevel.OTA.build.debug_level= -DDEBUG_ESP_OTA
heepACSwitch.menu.DebugLevel.COREWIFIHTTP_UPDATEUPDATEROTA=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA
heepACSwitch.menu.DebugLevel.COREWIFIHTTP_UPDATEUPDATEROTA.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA
heepACSwitch.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTA=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA
heepACSwitch.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTA.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA
heepACSwitch.menu.DebugLevel.NoAssert-NDEBUG=NoAssert-NDEBUG
heepACSwitch.menu.DebugLevel.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
heepACSwitch.menu.UploadSpeed.115200=115200
heepACSwitch.menu.UploadSpeed.115200.upload.speed=115200
heepACSwitch.menu.UploadSpeed.9600=9600
heepACSwitch.menu.UploadSpeed.9600.upload.speed=9600
heepACSwitch.menu.UploadSpeed.57600=57600
heepACSwitch.menu.UploadSpeed.57600.upload.speed=57600
heepACSwitch.menu.UploadSpeed.230400.linux=230400
heepACSwitch.menu.UploadSpeed.230400.macosx=230400
heepACSwitch.menu.UploadSpeed.230400.upload.speed=230400
heepACSwitch.menu.UploadSpeed.256000.windows=256000
heepACSwitch.menu.UploadSpeed.256000.upload.speed=256000
heepACSwitch.menu.UploadSpeed.460800.linux=460800
heepACSwitch.menu.UploadSpeed.460800.macosx=460800
heepACSwitch.menu.UploadSpeed.460800.upload.speed=460800
heepACSwitch.menu.UploadSpeed.512000.windows=512000
heepACSwitch.menu.UploadSpeed.512000.upload.speed=512000
heepACSwitch.menu.UploadSpeed.921600=921600
heepACSwitch.menu.UploadSpeed.921600.upload.speed=921600
